qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/stm32l0xx_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    stm32l0xx_hal_rcc_ex.h
  * @author  MCD Application Team
  * @version V1.2.0
  * @date    06-February-2015
  * @brief   Header file of RCC HAL Extension module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32L0xx_HAL_RCC_EX_H
#define __STM32L0xx_HAL_RCC_EX_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal_def.h"

/** @addtogroup STM32L0xx_HAL_Driver
  * @{
  */

/** @defgroup RCCEx
  * @{
  */ 

/* Exported types ------------------------------------------------------------*/ 
/** 
  * @brief  RCC extended clocks structure definition  
  */
#if !defined(STM32L031xx) && !defined(STM32L041xx) && !defined(STM32L051xx) && !defined(STM32L061xx) && !defined(STM32L071xx)  && !defined(STM32L081xx) 
typedef struct
{
  uint32_t PeriphClockSelection;   /*!< The Extended Clock to be configured.
                                        This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */
  uint32_t Usart1ClockSelection;   /*!< USART1 clock source      
                                        This parameter can be a value of @ref RCCEx_USART1_Clock_Source */
                                   
  uint32_t Usart2ClockSelection;   /*!< USART2 clock source      
                                        This parameter can be a value of @ref RCCEx_USART2_Clock_Source */
                                   
  uint32_t Lpuart1ClockSelection;  /*!< LPUART1 clock source      
                                        This parameter can be a value of @ref RCCEx_LPUART_Clock_Source */
                                   
  uint32_t I2c1ClockSelection;     /*!< I2C1 clock source      
                                        This parameter can be a value of @ref RCCEx_I2C1_Clock_Source */
#if defined (STM32L072xx) || defined(STM32L073xx) || defined(STM32L082xx) || defined(STM32L083xx)
  uint32_t I2c3ClockSelection;     /*!< I2C3 clock source      
                                        This parameter can be a value of @ref RCCEx_I2C3_Clock_Source */
#endif
                                   
  uint32_t RTCClockSelection;      /*!< Specifies RTC Clock Prescalers Selection
                                        This parameter can be a value of @ref RCC_RTC_Clock_Source */
#if defined (STM32L053xx) || defined(STM32L063xx) || defined(STM32L073xx) || defined(STM32L083xx)
  uint32_t LCDClockSelection;         /*!< specifies the LCD clock source.
                                           This parameter can be a value of @ref RCC_RTC_Clock_Source */
#endif
                                                                         
  uint32_t UsbClockSelection;      /*!< Specifies USB and RNG Clock  Selection
                                        This parameter can be a value of @ref RCCEx_USB_Clock_Source */

  uint32_t LptimClockSelection;    /*!< LPTIM1 clock source
                                        This parameter can be a value of @ref RCCEx_LPTIM1_Clock_Source */
  
}RCC_PeriphCLKInitTypeDef;


#else /* !(STM32L031xx) && !(STM32L041xx) && !(STM32L051xx) && !(STM32L061xx) && !(STM32L071xx) && !(STM32L081xx) */

typedef struct
{
  uint32_t PeriphClockSelection;   /*!< The Extended Clock to be configured.
                                        This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */
#if !defined (STM32L031xx) && !defined (STM32L041xx)
  uint32_t Usart1ClockSelection;   /*!< USART1 clock source      
                                        This parameter can be a value of @ref RCCEx_USART1_Clock_Source */
#endif
  uint32_t Usart2ClockSelection;   /*!< USART2 clock source      
                                        This parameter can be a value of @ref RCCEx_USART2_Clock_Source */
                                   
  uint32_t Lpuart1ClockSelection;  /*!< LPUART1 clock source      
                                        This parameter can be a value of @ref RCCEx_LPUART1_Clock_Source */
                                   
  uint32_t I2c1ClockSelection;     /*!< I2C1 clock source      
                                        This parameter can be a value of @ref RCCEx_I2C1_Clock_Source */
                                   
#if defined (STM32L071xx) || defined(STM32L081xx)
  uint32_t I2c3ClockSelection;     /*!< I2C3 clock source      
                                        This parameter can be a value of @ref RCCEx_I2C3_Clock_Source */
#endif

  uint32_t RTCClockSelection;      /*!< Specifies RTC Clock Prescalers Selection
                                        This parameter can be a value of @ref RCC_RTC_Clock_Source */
                                                                         
  uint32_t LptimClockSelection;    /*!< LPTIM1 clock source
                                        This parameter can be a value of @ref RCCEx_LPTIM1_Clock_Source */
  
}RCC_PeriphCLKInitTypeDef;

